[
  {
    "title": "Software Engineer, Internship",
    "description": "About the job\nWith 90 million active users and half a billion total downloads, Bending Spoons is one of Europe’s leading app developers. But we won’t rest on our laurels: Our sights are set on becoming the world’s best. That’s where you come in. Our bright, innovative, and collaborative software engineers are at the core of our ambitious mission—and we’re always seeking to add exceptional engineers to our team.\n\nWe’re searching for stand-out candidates who want to work in—and learn tons about—one of the following fields:\nBackend software engineering\nData engineering\nInfrastructure engineering\nMobile software engineering\nSecurity & privacy engineering\n\nDon’t worry if you’re not sure what area you’d like to work in just yet: We can take the time to chat about your interests and work out what’s likely to be the best fit for you. And when you apply for a job at Bending Spoons, we consider you for every suitable open position.\n\nPlease note that our internships (both full- and part-time) require a minimum commitment of 12 months.\n\nA few examples of your responsibilities:\nWork closely with other software engineers to expand our set of libraries and make our processes ever-more efficient.\nLearn about the latest and greatest technologies, testing the promising ones to make sure we don’t miss out on game-changing opportunities to boost our productivity and the enjoyment of our work.\nConstantly improve the quality of our products, tools, or infrastructures by fixing bugs and refactoring the code base where necessary.\nContribute to product development and product roadmap planning. Take a proactive role and ownership of the products you work on.\n\nWhat we look for\nLogical-analytical abilities. You’re able to objectively evaluate complex information, arguments, and situations. You’re used to applying logical deduction to tackle sophisticated problems, and this has often allowed you to solve difficult intellectual challenges.\nDrive. Your dedication matches the intensity of your ambition. You’re willing to put in the hard work necessary to achieve your goals, and the highly demanding challenges in your track record are proof of your relentless spirit.\nPassion. You have a genuine love for the field. You investigate the subject extensively and are always up to date with the latest developments.\nWillingness to learn. We use Python for backend, and Swift and Kotlin for mobile. But it's not a problem if you have little or no experience with them, as long as you’re enthusiastic about learning. We’d be happy to teach you!\nProficiency in English. You read, write, and speak proficiently in English.\nYou can work at least 25 hours per week. A full-time commitment is preferred, but we’ll consider applicants who can commit to around 25 hours per week.\n\nWhat we offer\nAn exceptional opportunity for growth. The majority of new Spooners didn’t expect to be trusted with so many responsibilities right from the start—and to be able to leverage them to explore the full extent of their potential. You’ll immediately start working in small, results-driven teams alongside some of the brightest people in your field. You’ll see Spooners in their 20s leading businesses worth hundreds of millions. And if you’ve got what it takes, you’ll soon be playing an essential role in major projects. We also do everything we can to offer a comprehensive spectrum of learning opportunities. Nothing but your drive, passion, and talent will determine how much and how fast you can grow.\nUnique engineering training. We pride ourselves on helping software engineers develop a well-rounded skill set: From time to time, you'll change projects and teams, broadening your skill set and helping keep things fresh. It’s a steep learning curve—we bet you can’t imagine how much you’ll have learned a year from now.\nAll. These. Benefits. Flexible hours, unrestricted remote working from European timezones, unlimited backing for learning and training, top-of-the-market health insurance, a highly supportive relocation package, generous parental support, and yearly retreats to stunning locations. We encourage Spooners to use these benefits and many more to create the conditions to do their best work.\nCompetitive salary and stock options. Our compensation packages are designed to attract and retain the best talent in the industry. Individuals just starting their career joining on a full-time contract are offered a salary of €63,965 along with a €1,200 welfare bonus. If you already have a few years of relevant work experience, you can expect to earn between €105,737 and €143,330, depending on your expertise. Compensation can grow rapidly as the individual accumulates experience and translates it into greater and greater impact. You also have the option to receive some of your pay in company ownership (equity) at a discounted rate. Also, Italy grants individuals willing to relocate a 50% tax exemption on Italian-sourced income.\n\nCommitment & contract\nFixed-term or internship. Full-time or part-time.\n\nLocation\nMilan (Italy) or fully remote.\n\nThe selection process\nIf you successfully pass through our screening process, we’ll invite you to take on a few tests that assess how you approach and solve unfamiliar problems. If you’re successful there, we’ll invite you to take part in some interviews. We welcome applications in English and Italian.\n\nBending Spoons is an equal opportunity and affirmative action employer. We consider for employment all applicants and we provide reasonable accommodations for candidates with disabilities, which can be requested at accommodations-ext@bendingspoons.com.\n\nStudies suggest that women tend not to apply for a job if their CV isn’t a perfect fit. Here, we look for talent and potential—not just experience and expertise. So if you like the role and think you could be awesome at it, go ahead and apply."
  },
  {
    "title": "5G Embedded Software Developer (M/F) - Zagreb, Split, Osijek",
    "description": "About the job\nEricsson Nikola Tesla Group has nearly 3000 employees, the majority of whom are from the STEM field. In addition to our ICT solutions in the telecom sector, we provide innovative solutions in health care, transport, state administration, municipal services and multimedia that improve people’s lives and create new value. With more than 70 years of tradition and continuous work on new technologies, we offer the perfect combination of experience and knowledge.\n\nWhat do we develop?\n\nWe perform software development, hardware integration, and system verification of the Radio Unit, a crucial node of the Ericsson Radio System portfolio.\n\nOur projects are vital contributors to the latest 5G solutions, as well as to enhancements of already deployed 4G products.\n\nYou can find our products being used all over the world, deployed by operators such as AT&T, T-Mobile, Softbank … There are literally millions of sites that rely on our expertise and bring wireless connectivity to billions of people.\n\nOur work environment\n\nWe are close to 20 teams in Zagreb and we cooperate daily with our colleagues around the world (Sweden, China, Canada …).\n\nOur teams are involved in all phases of the development cycle, including initial requirement analysis, study, design, implementation, verification, delivery, and maintenance. The teams are closely connected, and self-organizing, based on their own customization of Scrum or Kanban methodology.\n\nYour laptop might be Windows-based, but both the development and target environment are pure Linux.\n\nWhich competence areas do we need?\n\nThere is a wide range of technical expertise our teams require in their daily work:\n\nEmbedded systems with real-time capabilities (both hardware and software aspects)\nOperating system principles (Linux in particular)\nSignal processing\nAntenna systems\nComputer and mobile networks\nC/C++ programming language for product development\nSecure coding practices\nJava/Python/Perl/Bash for automation and verification\nCode repositories and versioning systems (such as Git and Gerrit)\nSoftware product build systems (such as Yocto and Automake)\nEricsson product-specific knowledge\nIntegration, troubleshooting, and debugging skills\n\nExpected levels of the above items are based on your seniority and the requirements of a specific project.\n\nWhat do we offer?\n\nIn addition to cutting-edge projects and technology, as well as the opportunity to work in a vibrant international team of experts, we can also point out the following:\n\nan opportunity to work in an inspiring working environment where you can develop your career, grow, innovate, and be a part of larger success story\nannual awards in accordance with the company’s business results and individual contribution\nincentive bonuses\ncompany restaurant and monthly meal allowance\nsports and cultural sections\nregular medical check-ups\nsupplementary health insurance\nflexible working hours\ncovered public transport costs\nand many more.\n\nOur expectations from you\n\nWe would like you to:\n\nFind our area of work intriguing\nHave expertise and interest in (several) mentioned technical areas\nBe ready for steep and continuous competence build-up\nSuccessfully collaborate with your colleagues\nFeel comfortable in an international work environment\n\nAssuming you found the description above interesting, please apply and include your CV. Any personal projects (on GitHub or similar) are also welcome.\n\nA closing note: final-year students of technical universities are also welcome to apply.\n\nCroatian citizenship or a work permit for Croatia is mandatory.\n\nCandidates will be evaluated and contacted only if they pass the initial screening.\n\nIn our Privacy notice you can find more about the way your personal information is handled.\n\n]]>"
  },
  {
    "title": "Software Developer (M/F) - Split",
    "description": "About the job\nEricsson Nikola Tesla Group has nearly 3000 employees, the majority of whom are from the STEM field. In addition to our ICT solutions in the telecom sector, we provide innovative solutions in health care, transport, state administration, municipal services and multimedia that improve people’s lives and create new value. With more than 70 years of tradition and continuous work on new technologies, we offer the perfect combination of experience and knowledge. Our Research and Development Center is one of the strongest telecom R&D centers in the region.\n\nEricsson Nikola Tesla’s 5G and IoT Telecom Radio Network Units are looking for a\n\nSoftware Developer (M/F) - Split\n\nAs an engineer, this job gives you the opportunity to develop in professionally structured SW Architecture while following good coding practices!\n\nWe are looking for:\n\nJunior or Senior skills in C/C++/C#/Java/Python or similar programming languages\nGenuine interest in agile SW development and SW craftsmanship to write a clean code\nCommitment to continuous learning \nWillingness to experiment-try-fail-learn\nDesire to share achievements and knowledge to help others and address their needs\n\nYour environment will be:\n\nDevelopment\nSW Product development - C/C++ and/or Java\nSW Versioning through Git\nSW Development close to HW and on higher levels\nApplying automatized Code metrics: Static and Dynamic code analysis\nDeveloping Test Automation framework in C++ and/or Java\nUsing and developing applied Machine learning tools\n\nEnvironment\nEmbedded Linux programming\nDeveloping 5G network and IoT\n\nTeam\nClosely connected, self-organizing teams, Scrum or Kanban agile methodology\nWork in a cross-functional team that covers Systemization, Software Design, and Verification\nThe following experience would be considered a plus:\n\nProgramming and Automated testing in a structured environment\nSW build tools, SW versioning, Continuous Integration, and Continuous Development\nLinux, Embedded and Real-time systems\n\nEnablers:\n\nUniversity degree (Bachelor’s or Master’s) from a technical university\nProficiency in English language\n\nWe offer: \n\nIn addition to cutting-edge projects and technology, as well as the vibrant international ecosystem of experts, we can also point out:\n\nAn opportunity to work within an inspiring working environment where you can develop your career, grow, innovate and be a part of a larger success story \nAnnual awards in accordance with the company's business success and individual contribution \nIncentive bonuses \nCompany restaurant and monthly meal allowance \nSports and cultural sections \nRegular medical check-ups \nFlexible working hours \nCovered public transport costs \n& many more\n\nCroatian citizenship or a work permit for Croatia is required.\n\nCandidates will be evaluated and contacted if they pass the initial screening.\n\nIn our Privacy notice, you can find more about handling your personal information.\n\nEricsson provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, marital status, pregnancy, parental status, national origin, ethnic background, age, disability, political opinion, social status, veteran status, union membership or genetics.\n\nEricsson complies with applicable country, state and all local laws governing nondiscrimination in employment in every location across the world in which the company has facilities. In addition, Ericsson supports the UN Guiding Principles for Business and Human Rights and the United Nations Global Compact.\n\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, training and development.\n\nEricsson expressly prohibits any form of workplace harassment based on race, color, religion, sex, sexual orientation, marital status, pregnancy, parental status, national origin, ethnic background, age, disability, political opinion, social status, veteran status, union membership or genetic information.\n\n]]>"
  },
  {
    "title": "Software Engineer",
    "description": "About the job\nHi 👋, we are Revendo, a Swiss company based in the city of Basel. Founded by two school friends in 2013 with one vision: Every used product deserves at least a second chance! Our concept is based on the circular economy and aims to reuse used products.\n\nFor our team in Split we are always looking for motivated and talented engineers in the areas (backend / frontend development, DevOps, QA). Our team is responsible for the development and operation of our own business systems. More about our work\n\nWe offer you\n\nA relaxed and creative work atmosphere that encourages productivity and motivation.\nScholarship for your children.\nPayed children kindergarten.\nTeam building and various fun activities within the company.\nWork equipment (Mac or Windows) that you can use at home in your free time and a large 4k monitor.\nPossibility of training through professional literature, seminars and certification.\nBonuses for personal advancement and bonuses for helping a company progress and grow.\n100% paid sick leave.\nFlexible working hours with a combination of work from home and office.\n\nYou have experience in some of our core technologies (PHP, Symfony, Vue.Js) or you are familiar with terms like microservice architecture, serverless or event driven architecture? Contact us, we are looking forward to getting to know you."
  },
  {
    "title": "Python Developer",
    "description": "About the job\nWe are looking for a mid/senior Python Developer\n\nResponsibilities\n\nMaintenance and development of the backend of an e-commerce application based on Django Rest Framework \nWriting unit tests for new functionalities \nDelivering readable and transparent code \nBuilding dashboards based on SQL queries and processing the results \nDirect contact with the client \n\nRequirements\n\nMinimum 3 years of experience working with Python \nKnowledge of Django, Django Rest Framework, Docker, Docker-compose, relational databases (e.g. PostgreSQL), Flask, Redis, Celery, postgresql \nEnglish at least B2 \nUnderstanding the right patterns and algorithms \nPractical analytical skills \nNice to have: Kubernetes, graphql, AWS / Google Cloud as well as Agile / SCRUM / Kanban \n\nWe Offer\n\nB2B contract type \nFull-time job \nRemote and flexible working hours"
  },
  {
    "title": "Junior Software Engineer (Student)",
    "description": "About the job\nYour profile\n\nWe are in search of a talented and passionate Junior Software Engineer to join our innovative team. If you are driven by the opportunity to solve complex problems, thrive in a fast-paced environment, and have a keen eye for detail, then this role is tailored for you.\n\nWhat You'll Do\n\nFocus on developing software solutions for clients \nUse best practices at every stage of the development cycle \nTroubleshoot and debug applications \n\nWhat We’re Looking For\n\nCurrent studies in Computer Science, Engineering, or a related field\nExperience/knowledge with C# and JavaScript (you’ll quickly adjust with previous knowledge of any of the following: Knockout, React, Angular)\nExperience with SQL; Plus is knowledge about OData, LinQ, EntityFramework\nExperience with using Git\nUnderstanding of RESTful Web Services\nUnderstanding of Agile methodologies such as Scrum\nFluency in English (written and spoken)\n\nWhat We Offer\n\nWork in a fast-growing and engaging industry\nDynamic workplaces (biking or standing behind your desk, currently also working from home)\nCompetitive salary and additional benefits (Birthday gift, Meal allowance, additional bonuses)\nA good cup of coffee or tea with a snack or fresh fruit available all day long\nTop-notch offices and equipment\nContinuous improvement and learning opportunities\nTeam activities, not the usual ones just to look nice on social media but what team members choose and ask for\n\nIf you're seeking a workplace where growth, flexibility, and a sense of community come together, we invite you to explore this exciting opportunity with us.\n\nAbout Us\n\nThe first thing you may be asking yourself is, what is Cenosco all about?\n\nWe're an Asset Integrity Management (AIM) Software company. Essentially, this means that our solutions safeguard integrity, reliability, and instrumentation safety in asset-heavy industries. Companies operating in these industries come with complex operational ecosystems, and we aim to support their capability to operate at full potential, with the latest technologies, all while prioritizing the health and safety of their people and the environment.\n\nVision\n\nWe envision safe and smart environments for asset-heavy industries - where their software environment, work environment, and surrounding environment, operate smartly and securely, allowing them to function at their full potential, without jeopardizing the health and safety of their people and the planet.\n\nMission\n\nWe are dedicated to making this vision a reality, by optimizing and spreading our integrity management solutions. Through continuous innovation and development of our IMS Suite, we strive to remain the market standard for integrity management solutions.\n\nThe Cenosco Culture\n\nOur work culture is bound by our four core values. These values have been carefully crafted and selected internally to ensure that they served as a reflection of who we are and how we work across the entire company. At Cenosco we operate with these values at heart, and therefore consider them to be vital competencies.\n\nActing With Integrity\n\nWe are trustworthy and reliable.\n\nBehaving Innovatively\n\nWe are agile, curious, and keep growing.\n\nOwning And Delivering\n\nWe take ownership, responsibility and strive for success.\n\nPlaying As a Team\n\nWe are attentive, inspire, have fun and celebrate our successes."
  },
  {
    "title": "Java Developer",
    "description": "About the job\nWe are looking for Java Developer!\n\nResponsibilities\n\nWork directly with a client\nDevelop product written in Java\nFocus on writing clean and readable code\nUtilizing the best architectural patterns like TDD\nAnalyze, develop and test, server side modules\n\nRequirements\n\nMinimum 2 years of experience working with Java\nKnowledge of Spring framework, spring boot, hibernate\nFamilarity with linux based development\nKnowledge of data repositories like Postgres, MySQL\nExperience developing REST API’s and/or integrating with them\nUnderstanding of agile development methodology\n\nWe Offer\n\n$37 - $45 /hour (net) \nB2B contract type\nFull-time job\nRemote and flexible working hours"
  },
  {
    "title": "Java Developer",
    "description": "About the job\nWe are looking for Java Developer!\n\nResponsibilities\n\nWork directly with a client\nDevelop product written in Java\nFocus on writing clean and readable code\nUtilizing the best architectural patterns like TDD\nAnalyze, develop and test, server side modules\n\nRequirements\n\nMinimum 2 years of experience working with Java\nKnowledge of Spring framework, spring boot, hibernate\nFamilarity with linux based development\nKnowledge of data repositories like Postgres, MySQL\nExperience developing REST API’s and/or integrating with them\nUnderstanding of agile development methodology\n\nWe Offer\n\n$37 - $45 /hour (net) \nB2B contract type\nFull-time job\nRemote and flexible working hours"
  },
  {
    "title": "Java Developer",
    "description": "About the job\nWe are looking for Java Developer!\n\nResponsibilities\n\nWork directly with a client\nDevelop product written in Java\nFocus on writing clean and readable code\nUtilizing the best architectural patterns like TDD\nAnalyze, develop and test, server side modules\n\nRequirements\n\nMinimum 2 years of experience working with Java\nKnowledge of Spring framework, spring boot, hibernate\nFamilarity with linux based development\nKnowledge of data repositories like Postgres, MySQL\nExperience developing REST API’s and/or integrating with them\nUnderstanding of agile development methodology\n\nWe Offer\n\n$37 - $45 /hour (net) \nB2B contract type\nFull-time job\nRemote and flexible working hours"
  },
  {
    "title": "Web Developer",
    "description": "About the job\nOur mission is great open source\n\nIt is our mission to make open source software available to people everywhere. We create world-renowned software, impacting the lives of millions of people every day.\n\nThe web team works in a multi-disciplinary environment with visual designers, UX designers and other developers to bring exciting new web projects to life. We help and learn from each other and constantly strive to improve both our work and our processes.\n\nRequired Skills And Experience\n\nDemonstrable experience of work on modern web applications\nA strong understanding of HTML, CSS with SCSS and JavaScript\nExperience with Javascript components libraries\nExperience with TypeScript\nExperience with responsive user interfaces for a wide range of devices and browsers\nExperience with Git or other version control systems\nAwareness of SEO best practice\nConsideration of accessibility in all aspects of your work\nA strong understanding of web performance in complex user interfaces\nAbility to interact with UX, designers and server-side developers\nCuriosity about technology and a thirst to learn\nBased in EMEA timezones (Europe, the Middle East and Africa)\nUniversity degree or equivalent education\n\nUseful experience if you have it\n\nFamiliarity with Linux desktop technologies\nServer-side languages, such as Python or NodeJS\nExperience working on a large scale React (with TypeScript) project\nA history of open source contributions\nRelevant work experience\n\nWho you are\n\nWe want a Web Developer who loves what they do. You are passionate about web standards and keep abreast of new developments in our industry. You always look for opportunities to improve your skills. You like to show off what you're working on and also learn from others. You have strong attention to detail and value the design of a product as much as you value the code. You have strong communication skills and maybe even blog once in a while. You're aware of the latest CSS techniques but also know the limitations that developing for a broad audience can bring - actually, you embrace the challenge.\n\nIn this team\n\nYou'll create high fidelity websites and web apps using the latest incarnations of HTML, CSS (SCSS) and Javascript (React and TypeScript)\nYou'll help maintain existing projects including updating content and adding new pages\nYou'll manage incoming requests for updates and liaise with or delegate to other people as necessary\nYou'll ensure the standard of our output remains high and consistent across our whole product portfolio\nYou'll ensure new pages are published according to specification and in compliance with our web style guide\nYou'll participate in and contribute to our living style guide, Vanilla Framework.\nWork closely with UX designers and visual designers to implement exemplary user experiences.\n\nWhat we offer\n\nAn opportunity to help shape a company and products with a strong influence in the open source community\nAn inclusive work environment within a team of friendly people with a broad range of skill sets, from UX designers to copywriters\nLearning and development\nAnnual compensation review\nRecognition rewards\nAnnual leave\nPriority Pass for travel\n\nWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity we will give your application fair consideration."
  },
  {
    "title": "Web Developer",
    "description": "About the job\nOur mission is great open source\n\nIt is our mission to make open source software available to people everywhere. We create world-renowned software, impacting the lives of millions of people every day.\n\nThe web team works in a multi-disciplinary environment with visual designers, UX designers and other developers to bring exciting new web projects to life. We help and learn from each other and constantly strive to improve both our work and our processes.\n\nRequired Skills And Experience\n\nDemonstrable experience of work on modern web applications\nA strong understanding of HTML, CSS with SCSS and JavaScript\nExperience with Javascript components libraries\nExperience with TypeScript\nExperience with responsive user interfaces for a wide range of devices and browsers\nExperience with Git or other version control systems\nAwareness of SEO best practice\nConsideration of accessibility in all aspects of your work\nA strong understanding of web performance in complex user interfaces\nAbility to interact with UX, designers and server-side developers\nCuriosity about technology and a thirst to learn\nBased in EMEA timezones (Europe, the Middle East and Africa)\nUniversity degree or equivalent education\n\nUseful experience if you have it\n\nFamiliarity with Linux desktop technologies\nServer-side languages, such as Python or NodeJS\nExperience working on a large scale React (with TypeScript) project\nA history of open source contributions\nRelevant work experience\n\nWho you are\n\nWe want a Web Developer who loves what they do. You are passionate about web standards and keep abreast of new developments in our industry. You always look for opportunities to improve your skills. You like to show off what you're working on and also learn from others. You have strong attention to detail and value the design of a product as much as you value the code. You have strong communication skills and maybe even blog once in a while. You're aware of the latest CSS techniques but also know the limitations that developing for a broad audience can bring - actually, you embrace the challenge.\n\nIn this team\n\nYou'll create high fidelity websites and web apps using the latest incarnations of HTML, CSS (SCSS) and Javascript (React and TypeScript)\nYou'll help maintain existing projects including updating content and adding new pages\nYou'll manage incoming requests for updates and liaise with or delegate to other people as necessary\nYou'll ensure the standard of our output remains high and consistent across our whole product portfolio\nYou'll ensure new pages are published according to specification and in compliance with our web style guide\nYou'll participate in and contribute to our living style guide, Vanilla Framework.\nWork closely with UX designers and visual designers to implement exemplary user experiences.\n\nWhat we offer\n\nAn opportunity to help shape a company and products with a strong influence in the open source community\nAn inclusive work environment within a team of friendly people with a broad range of skill sets, from UX designers to copywriters\nLearning and development\nAnnual compensation review\nRecognition rewards\nAnnual leave\nPriority Pass for travel\n\nWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity we will give your application fair consideration."
  },
  {
    "title": "Software Developer (M/F) - Zagreb",
    "description": "About the job\nEricsson Nikola Tesla Group has nearly 3000 employees, the majority of whom are from the STEM field. In addition to our ICT solutions in the telecom sector, we provide innovative solutions in health care, transport, state administration, municipal services and multimedia that improve people’s lives and create new value. With more than 70 years of tradition and continuous work on new technologies, we offer the perfect combination of experience and knowledge. Our Research and Development Center is one of the strongest telecom R&D centers in the region.\n\nWe are looking for a motivated person for the position of:\n\nSoftware Developer (M/F)\n\nWork location: Zagreb\n\nWhat do we develop?\n\nIn our team, we are using various SAP knowledge-based Configurators (VC, SSC, and IPC) and developing next-generation solutions that present a major application area for artificial intelligence (AI), and it is based on modeling of the configurations in a manner that allows the utilization of AI techniques for searching for a valid configuration to meet the needs of a customer.\n\nOur team is involved in developing product packages for the Ericsson Networks Portfolio consisting of software, hardware, and services and developing tools that are used in the CPQ (Configure, Price, Quote) process.\n\nOur R&D center gathers almost 1600 software developers in our locations in Zagreb, Split, and Osijek and we cooperate daily with our colleagues around the world. Our teams are involved in all phases of the development cycle, including initial requirement analysis, study, design, implementation, verification, delivery, and maintenance. The teams are closely connected, and self-organizing, based on their own customization of Scrum or Kanban methodology.\n\nWhich competence areas do we need?\n\nYou will be developing product packages in the SSC or Java-based tools and maintaining continuous releases using different technologies.\n\nThe following competence areas are preferred:\n\nPattern recognition skill\nLogical thinking & reasoning skill\nGrasp mathematical principles and models\nDatabase modeling knowledge\nJava\nSQL\nSAP SSC or VC (optional)\n\nYou will work in an agile way, where you will be a member of a cross-functional team that covers Systemization, Software Design, and Verification.\n\nExpected levels of the above items are based on your seniority and the requirements of a specific project.\n\nFinal-year students of technical universities are also welcome to apply.\n\nOur expectations from you:\n\nWe would like you to:\n\nFind our area of work intriguing\nHave expertise and interest in (several) mentioned technical areas\nBe ready for steep and continuous competence build-up\nSuccessfully collaborate with your colleagues\nFeel comfortable in an international work environment\n\nWe offer:\n\nIn addition to cutting-edge projects and technology, as well as the opportunity to work in a vibrant international team of experts, we can also point out the following:\n\nan opportunity to work in an inspiring working environment where you can develop your career, grow, innovate, and be a part of larger success story\nannual awards in accordance with the company’s business results and individual contribution\nincentive bonuses\ncompany restaurant and monthly meal allowance\nsports and cultural sections\nregular medical check-ups\nsupplementary health insurance\nflexible working hours\ncovered public transport costs\nand many more.\n\nAssuming you found the description above interesting, please apply and include your CV. Any personal projects (on GitHub or similar) are also welcome.\n\nCroatian citizenship or a work permit for Croatia is mandatory.\n\nCandidates will be evaluated and contacted only if they pass the initial screening.\n\nIn our Privacy notice you can find more about the way your personal information is handled.\n\n]]>"
  },
  {
    "title": "Software Developer (M/F) - Zagreb",
    "description": "About the job\nEricsson Nikola Tesla Group has nearly 3000 employees, the majority of whom are from the STEM field. In addition to our ICT solutions in the telecom sector, we provide innovative solutions in health care, transport, state administration, municipal services and multimedia that improve people’s lives and create new value. With more than 70 years of tradition and continuous work on new technologies, we offer the perfect combination of experience and knowledge. Our Research and Development Center is one of the strongest telecom R&D centers in the region.\n\nWe are looking for a motivated person for the position of:\n\nSoftware Developer (M/F)\n\nWork location: Zagreb\n\nWhat do we develop?\n\nIn our team, we are using various SAP knowledge-based Configurators (VC, SSC, and IPC) and developing next-generation solutions that present a major application area for artificial intelligence (AI), and it is based on modeling of the configurations in a manner that allows the utilization of AI techniques for searching for a valid configuration to meet the needs of a customer.\n\nOur team is involved in developing product packages for the Ericsson Networks Portfolio consisting of software, hardware, and services and developing tools that are used in the CPQ (Configure, Price, Quote) process.\n\nOur R&D center gathers almost 1600 software developers in our locations in Zagreb, Split, and Osijek and we cooperate daily with our colleagues around the world. Our teams are involved in all phases of the development cycle, including initial requirement analysis, study, design, implementation, verification, delivery, and maintenance. The teams are closely connected, and self-organizing, based on their own customization of Scrum or Kanban methodology.\n\nWhich competence areas do we need?\n\nYou will be developing product packages in the SSC or Java-based tools and maintaining continuous releases using different technologies.\n\nThe following competence areas are preferred:\n\nPattern recognition skill\nLogical thinking & reasoning skill\nGrasp mathematical principles and models\nDatabase modeling knowledge\nJava\nSQL\nSAP SSC or VC (optional)\n\nYou will work in an agile way, where you will be a member of a cross-functional team that covers Systemization, Software Design, and Verification.\n\nExpected levels of the above items are based on your seniority and the requirements of a specific project.\n\nFinal-year students of technical universities are also welcome to apply.\n\nOur expectations from you:\n\nWe would like you to:\n\nFind our area of work intriguing\nHave expertise and interest in (several) mentioned technical areas\nBe ready for steep and continuous competence build-up\nSuccessfully collaborate with your colleagues\nFeel comfortable in an international work environment\n\nWe offer:\n\nIn addition to cutting-edge projects and technology, as well as the opportunity to work in a vibrant international team of experts, we can also point out the following:\n\nan opportunity to work in an inspiring working environment where you can develop your career, grow, innovate, and be a part of larger success story\nannual awards in accordance with the company’s business results and individual contribution\nincentive bonuses\ncompany restaurant and monthly meal allowance\nsports and cultural sections\nregular medical check-ups\nsupplementary health insurance\nflexible working hours\ncovered public transport costs\nand many more.\n\nAssuming you found the description above interesting, please apply and include your CV. Any personal projects (on GitHub or similar) are also welcome.\n\nCroatian citizenship or a work permit for Croatia is mandatory.\n\nCandidates will be evaluated and contacted only if they pass the initial screening.\n\nIn our Privacy notice you can find more about the way your personal information is handled.\n\n]]>"
  },
  {
    "title": "Java Software Engineer",
    "description": "About the job\nWe believe that we are better together, and at Tripadvisor we welcome you for who you are. Our workplace is for everyone, as is our people powered platform. At Tripadvisor, we want you to bring your unique perspective and experiences, so we can collectively revolutionize travel and together find the good out there.\n\nThe Places team mission is to build the world's best engine for managing location data. We are enhancing data collection on the main site and our mobile apps, building a data processing pipeline, integrating with third-party vendors, and leveraging machine learning, all to curate location data valuable to TripAdvisor users and our partners.\n\nAs a Java Software Engineer, you will independently develop features in support of our products across all layers of the stack. You will be responsible for designing relational databases, microservices, APIs, and interactive user interfaces. Through your work you will grow expertise in one or more technologies and share your learnings with your team. You will be responsible for testing the software you write and will maintain your features once released. As a Software Engineer II, you will actively provide code reviews to your peers, ensuring that team standards and best practices are adhered to. Similarly, you will actively seek feedback from your peers and promote a collaborative and fast-paced engineering culture.\n\nWhat You'll Do\n\nCode! Most of our engineer’s release code to production every few days and we have a daily release cycle.\nDesign and implement the technical solutions for projects\nWork closely with our product and design teams to define feature specifications\nBe responsible for the quality of code you ship\nActively provide feedback on best practices and design patterns to your peers in the form of code reviews\nDevelop, deploy and maintain full stack implementations of owner and consumer-facing features\nBe responsible for all aspects of software engineering, from design to implementation, QA, operations and maintenance.\nWork alongside other engineering groups located around the world - US East Coast, UK, Central and Eastern Europe. \n\nSkills And Experience\n\nBachelor of Science in Computer Science or equivalent\n4+ years of large scale, full life cycle development experience\nSolid foundation in data structures, algorithms, and OO design\nExperience building microservices, event-driven and domain-oriented architectures\nExperience with full stack web development in JavaScript and Java. The team develops with JavaScript/React, Java, Tomcat, Linux, PostgreSQL, Snowflake, Docker, Kubernetes, Kafka \nCloud Platform experience (AWS) desired\n Experience with data processing or ML modeling is a plus.\n\nIf you need a reasonable accommodation or support during the application or the recruiting process due to a medical condition or disability, please reach out to your individual recruiter or send an email to AccessibleRecruiting@Tripadvisor.com and let us know the nature of your request . Please include the job requisition number in your message."
  },
  {
    "title": "Java Software Engineer",
    "description": "About the job\nWe believe that we are better together, and at Tripadvisor we welcome you for who you are. Our workplace is for everyone, as is our people powered platform. At Tripadvisor, we want you to bring your unique perspective and experiences, so we can collectively revolutionize travel and together find the good out there.\n\nThe Places team mission is to build the world's best engine for managing location data. We are enhancing data collection on the main site and our mobile apps, building a data processing pipeline, integrating with third-party vendors, and leveraging machine learning, all to curate location data valuable to TripAdvisor users and our partners.\n\nAs a Java Software Engineer, you will independently develop features in support of our products across all layers of the stack. You will be responsible for designing relational databases, microservices, APIs, and interactive user interfaces. Through your work you will grow expertise in one or more technologies and share your learnings with your team. You will be responsible for testing the software you write and will maintain your features once released. As a Software Engineer II, you will actively provide code reviews to your peers, ensuring that team standards and best practices are adhered to. Similarly, you will actively seek feedback from your peers and promote a collaborative and fast-paced engineering culture.\n\nWhat You'll Do\n\nCode! Most of our engineer’s release code to production every few days and we have a daily release cycle.\nDesign and implement the technical solutions for projects\nWork closely with our product and design teams to define feature specifications\nBe responsible for the quality of code you ship\nActively provide feedback on best practices and design patterns to your peers in the form of code reviews\nDevelop, deploy and maintain full stack implementations of owner and consumer-facing features\nBe responsible for all aspects of software engineering, from design to implementation, QA, operations and maintenance.\nWork alongside other engineering groups located around the world - US East Coast, UK, Central and Eastern Europe. \n\nSkills And Experience\n\nBachelor of Science in Computer Science or equivalent\n4+ years of large scale, full life cycle development experience\nSolid foundation in data structures, algorithms, and OO design\nExperience building microservices, event-driven and domain-oriented architectures\nExperience with full stack web development in JavaScript and Java. The team develops with JavaScript/React, Java, Tomcat, Linux, PostgreSQL, Snowflake, Docker, Kubernetes, Kafka \nCloud Platform experience (AWS) desired\n Experience with data processing or ML modeling is a plus.\n\nIf you need a reasonable accommodation or support during the application or the recruiting process due to a medical condition or disability, please reach out to your individual recruiter or send an email to AccessibleRecruiting@Tripadvisor.com and let us know the nature of your request . Please include the job requisition number in your message."
  },
  {
    "title": "Fullstack Developer (Node.JS & React)",
    "description": "About the job\nWe are seeking a skilled Node.js and React Developer\n\nIf you are passionate about web development and have a solid understanding of both Node.js and React, we'd love to know you better!\n\nResponsibilities\n\nDevelop and maintain efficient and scalable web applications using Node.js and React \nCollaborate with cross-functional teams to define, design, and ship new features \nTroubleshoot and resolve software defects and issues \nOptimize application performance for maximum speed and scalability \nStay updated with industry trends and emerging technologies \n\nRequirements\n\nAt least 2 years of professional experience as a Node.js and React Developer \nStrong proficiency in Node.js and React frameworks \nSolid understanding of JavaScript, HTML, and CSS \nExperience with RESTful APIs and third-party libraries \nFamiliarity with version control systems (e.g., Git) \nStrong problem-solving and debugging skills \nAbility to work independently and collaboratively in a team environment \nExcellent communication and interpersonal skills\n\nWe Offer\n\nB2B contract type \nFull-time job \nRemote and flexible working hours"
  },
  {
    "title": "Fullstack Developer (Node.JS & React)",
    "description": "About the job\nWe are seeking a skilled Node.js and React Developer\n\nIf you are passionate about web development and have a solid understanding of both Node.js and React, we'd love to know you better!\n\nResponsibilities\n\nDevelop and maintain efficient and scalable web applications using Node.js and React \nCollaborate with cross-functional teams to define, design, and ship new features \nTroubleshoot and resolve software defects and issues \nOptimize application performance for maximum speed and scalability \nStay updated with industry trends and emerging technologies \n\nRequirements\n\nAt least 2 years of professional experience as a Node.js and React Developer \nStrong proficiency in Node.js and React frameworks \nSolid understanding of JavaScript, HTML, and CSS \nExperience with RESTful APIs and third-party libraries \nFamiliarity with version control systems (e.g., Git) \nStrong problem-solving and debugging skills \nAbility to work independently and collaboratively in a team environment \nExcellent communication and interpersonal skills\n\nWe Offer\n\nB2B contract type \nFull-time job \nRemote and flexible working hours"
  },
  {
    "title": "Java Developer",
    "description": "About the job\nWe are looking for Java Developer!\n\nResponsibilities\n\nWork directly with a client\nDevelop product written in Java\nFocus on writing clean and readable code\nUtilizing the best architectural patterns like TDD\nAnalyze, develop and test, server side modules\n\nRequirements\n\nMinimum 2 years of experience working with Java\nKnowledge of Spring framework, spring boot, hibernate\nFamilarity with linux based development\nKnowledge of data repositories like Postgres, MySQL\nExperience developing REST API’s and/or integrating with them\nUnderstanding of agile development methodology\n\nWe Offer\n\n$37 - $45 /hour (net) \nB2B contract type\nFull-time job\nRemote and flexible working hours"
  },
  {
    "title": "Java Developer",
    "description": "About the job\nWe are looking for Java Developer!\n\nResponsibilities\n\nWork directly with a client\nDevelop product written in Java\nFocus on writing clean and readable code\nUtilizing the best architectural patterns like TDD\nAnalyze, develop and test, server side modules\n\nRequirements\n\nMinimum 2 years of experience working with Java\nKnowledge of Spring framework, spring boot, hibernate\nFamilarity with linux based development\nKnowledge of data repositories like Postgres, MySQL\nExperience developing REST API’s and/or integrating with them\nUnderstanding of agile development methodology\n\nWe Offer\n\n$37 - $45 /hour (net) \nB2B contract type\nFull-time job\nRemote and flexible working hours"
  },
  {
    "title": "JS (React, Node.JS) Developer",
    "description": "About the job\nWe're looking for a Senior JavaScript Developer with expertise in React and Node.js!\n\nResponsibilities\n\nDesigning, developing, and maintaining scalable and performant web applications using JavaScript, React, and Node.js\nCollaborating with cross-functional teams to gather requirements, plan projects, and ensure successful project delivery\nWriting clean, efficient, and maintainable code following best practices and industry standards\nConducting code reviews and providing constructive feedback to team members\nTroubleshooting and debugging complex technical issues and providing timely resolutions\nMentoring and guiding junior developers, sharing your knowledge and expertise\nStaying up-to-date with the latest trends and advancements in JavaScript, React, and Node.js development\n\nRequirements\n\nExtensive experience in JavaScript development, with a strong focus on React and Node.js\nProficiency in front-end technologies such as HTML, CSS, and JavaScript frameworks (e.g., React, Redux)\nSolid understanding of server-side JavaScript frameworks (e.g., Express, Koa) and RESTful API development\nExperience with database systems such as MongoDB, PostgreSQL, or MySQL\nFamiliarity with version control systems (e.g., Git) and agile development methodologies\nStrong problem-solving and analytical skills\nExcellent communication and collaboration abilities\n\nWe Offer\n\nCompetitive compensation packages\nSupportive work environment\nOpportunities for growth and advancement within our organization"
  },
  {
    "title": "JS (React, Node.JS) Developer",
    "description": "About the job\nWe're looking for a Senior JavaScript Developer with expertise in React and Node.js!\n\nResponsibilities\n\nDesigning, developing, and maintaining scalable and performant web applications using JavaScript, React, and Node.js\nCollaborating with cross-functional teams to gather requirements, plan projects, and ensure successful project delivery\nWriting clean, efficient, and maintainable code following best practices and industry standards\nConducting code reviews and providing constructive feedback to team members\nTroubleshooting and debugging complex technical issues and providing timely resolutions\nMentoring and guiding junior developers, sharing your knowledge and expertise\nStaying up-to-date with the latest trends and advancements in JavaScript, React, and Node.js development\n\nRequirements\n\nExtensive experience in JavaScript development, with a strong focus on React and Node.js\nProficiency in front-end technologies such as HTML, CSS, and JavaScript frameworks (e.g., React, Redux)\nSolid understanding of server-side JavaScript frameworks (e.g., Express, Koa) and RESTful API development\nExperience with database systems such as MongoDB, PostgreSQL, or MySQL\nFamiliarity with version control systems (e.g., Git) and agile development methodologies\nStrong problem-solving and analytical skills\nExcellent communication and collaboration abilities\n\nWe Offer\n\nCompetitive compensation packages\nSupportive work environment\nOpportunities for growth and advancement within our organization"
  },
  {
    "title": "Flutter Developer",
    "description": "About the job\nWe are looking for Flutter Developer\n\nResponsibilities\n\nDeveloping mobile application with Flutter \nFocusing on clean, readable code \nWork directly with the client \nBeing part of crucial project decisions: designing architecture, choosing frameworks and tools \n\nRequirements\n\nKey knowledge of Flutter, \nKnowledge of the library / tools e.g. BLoC, Firebase Crashlytics, Firebase Cloud Messaging \nGoogle Maps, Stripe, Freshchat SDK, json_serializable, dio/kiwi \nGood use of JavaScript or Dart \nGood understanding of REST \nUnderstanding the right patterns and algorithms \nPractical analytical skills \nCommunicative English skills \n\nWe Offer\n\nB2B contract type \nFull-time job \nRemote and flexible working hours"
  },
  {
    "title": "Flutter Developer",
    "description": "About the job\nWe are looking for Flutter Developer\n\nResponsibilities\n\nDeveloping mobile application with Flutter \nFocusing on clean, readable code \nWork directly with the client \nBeing part of crucial project decisions: designing architecture, choosing frameworks and tools \n\nRequirements\n\nKey knowledge of Flutter, \nKnowledge of the library / tools e.g. BLoC, Firebase Crashlytics, Firebase Cloud Messaging \nGoogle Maps, Stripe, Freshchat SDK, json_serializable, dio/kiwi \nGood use of JavaScript or Dart \nGood understanding of REST \nUnderstanding the right patterns and algorithms \nPractical analytical skills \nCommunicative English skills \n\nWe Offer\n\nB2B contract type \nFull-time job \nRemote and flexible working hours"
  },
  {
    "title": "Vue.js Developer (Nuxt",
    "description": "About the job\nWe are looking for Vue.js Developer with excellent knowledge of Nuxt and Storefront 2\n\nResponsibilities\n\nDeveloping and maintaining web applications using Vue.js and Nuxt.js frameworks \nCreating interactive user interfaces and implementing complex features based on Storefront 2 \nDesigning and implementing scalable, modular, and reusable code with Vue.js and Nuxt.js \nOptimizing web application performance by identifying and addressing performance bottlenecks \nTroubleshooting issues and debugging code to ensure the smooth operation of web applications \nWorking with HTML, CSS, and JavaScript to create responsive web designs \n\nRequirements\n\nMinimum 2 years of experience as Vue.js Developer \nExcellent knowledge of Nuxt framework \nExperience working with Vue Storefront 2 \nAbility to design and develop interactive web applications \nKnowledge of HTML, CSS, and JavaScript \nCommunicative English skills \n\nWe Offer\n\nB2B contract type \nFull-time job \nRemote and flexible working hours."
  },
  {
    "title": "Vue.js Developer (Nuxt",
    "description": "About the job\nWe are looking for Vue.js Developer with excellent knowledge of Nuxt and Storefront 2\n\nResponsibilities\n\nDeveloping and maintaining web applications using Vue.js and Nuxt.js frameworks \nCreating interactive user interfaces and implementing complex features based on Storefront 2 \nDesigning and implementing scalable, modular, and reusable code with Vue.js and Nuxt.js \nOptimizing web application performance by identifying and addressing performance bottlenecks \nTroubleshooting issues and debugging code to ensure the smooth operation of web applications \nWorking with HTML, CSS, and JavaScript to create responsive web designs \n\nRequirements\n\nMinimum 2 years of experience as Vue.js Developer \nExcellent knowledge of Nuxt framework \nExperience working with Vue Storefront 2 \nAbility to design and develop interactive web applications \nKnowledge of HTML, CSS, and JavaScript \nCommunicative English skills \n\nWe Offer\n\nB2B contract type \nFull-time job \nRemote and flexible working hours."
  }
]